ada-sound/X-CUBE-USB-AUDIO/STM32CubeExpansion_USBAudioStreaming_V1.0.0/Projects/STM32F446E_EVAL/Applications/USB_Device/Extension/Drivers/BSP/STM32446E_EVAL/stm32446e_eval_audio_ex.c
  /* Init the I2S */
  HAL_I2S_Init(&haudio_in_i2s); 

 /* Disable I2S block */
  __HAL_I2S_ENABLE(&haudio_in_i2s);
}

/**
  * @brief  Deinitializes the Audio Codec audio interface (I2S).
  */
static void I2Sx_DeInit(void)
{
  /* Initialize the hAudioInI2s Instance parameter */
  haudio_in_i2s.Instance = AUDIO_I2Sx;

 /* Disable I2S block */
  __HAL_I2S_DISABLE(&haudio_in_i2s);

  /* DeInit the I2S */
  HAL_I2S_DeInit(&haudio_in_i2s); 
}

/**
  * @brief  Initializes the TIM INput Capture MSP.
  * @param  htim: TIM handle
  */
static void TIM_VolumeChangeIC_MspInit(TIM_HandleTypeDef *htim)
{
  GPIO_InitTypeDef   gpio_init_structure;
  
  /* Enable peripherals and GPIO Clocks --------------------------------------*/
  /* TIM_VolumeChange Peripheral clock enable */
  AUDIO_TIM_VolumeChangeCLK_ENABLE();
    
  /* Enable GPIO Channels Clock */
  AUDIO_TIM_VolumeChangeGPIO_CLK_ENABLE();
  
  /* Configure I/Os ----------------------------------------------------------*/
  /* Common configuration for all channels */
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_HIGH;
  gpio_init_structure.Alternate = AUDIO_TIM_VolumeChangeAF;
  
  /* Configure TIM input channel */
  gpio_init_structure.Pin = AUDIO_TIM_VolumeChangeIN_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_TIM_VolumeChangeGPIO_PORT, &gpio_init_structure);

  /* Configure TIM output channel */
  gpio_init_structure.Pin = AUDIO_TIM_VolumeChangeOUT_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_TIM_VolumeChangeGPIO_PORT, &gpio_init_structure);

}

/**
  * @brief  Initializes the TIM INput Capture MSP.
  * @param  htim: TIM handle
  */
static void TIM_VolumeChangeIC_MspDeInit(TIM_HandleTypeDef *htim)
{
    /* Disable TIM_VolumeChange Peripheral clock  */
    AUDIO_TIM_VolumeChangeCLK_DISABLE();

    /* GPIO pins clock and DMA clock can be shut down in the applic 
       by surcgarging this __weak function */ 
}

/**
  * @brief  Configure TIM as a clock divider by 2.
  *         I2S_SCK is externally connected to TIM_VolumeChange input channel
  */
static void TIM_VolumeChangeInit(void)
{
  TIM_IC_InitTypeDef     s_ic_config;
  TIM_OC_InitTypeDef     s_oc_config;
  TIM_ClockConfigTypeDef s_clk_source_config;
  TIM_SlaveConfigTypeDef s_slave_config;
  
  /* Configure the TIM peripheral --------------------------------------------*/
  /* Set TIM_VolumeChange instance */
  haudio_tim.Instance = AUDIO_TIM_VolumeChange;
  /* Timer Input Capture Configuration Structure declaration */
   /* Initialize TIM_VolumeChange peripheral as follow:
       + Period = 0xFFFF
       + Prescaler = 0
       + ClockDivision = 0
       + Counter direction = Up
  */
  haudio_tim.Init.Period        = 1;
  haudio_tim.Init.Prescaler     = 0;
  haudio_tim.Init.ClockDivision = 0;
  haudio_tim.Init.CounterMode   = TIM_COUNTERMODE_UP; 
  
  /* Initialize the TIM_VolumeChange peripheral with the structure above */
  TIM_VolumeChangeIC_MspInit(&haudio_tim);
  HAL_TIM_IC_Init(&haudio_tim);
  
  /* Configure the Input Capture channel -------------------------------------*/ 
  /* Configure the Input Capture of channel 2 */
  s_ic_config.ICPolarity  = TIM_ICPOLARITY_FALLING;
  s_ic_config.ICSelection = TIM_ICSELECTION_DIRECTTI;
  s_ic_config.ICPrescaler = TIM_ICPSC_DIV1;
  s_ic_config.ICFilter    = 0;
  HAL_TIM_IC_ConfigChannel(&haudio_tim, &s_ic_config, AUDIO_TIM_VolumeChangeIN_CHANNEL);
  
  /* Select external clock mode 1 */
  s_clk_source_config.ClockSource = TIM_CLOCKSOURCE_ETRMODE1;
  s_clk_source_config.ClockPolarity = TIM_CLOCKPOLARITY_NONINVERTED;
  s_clk_source_config.ClockPrescaler = TIM_CLOCKPRESCALER_DIV1;
  s_clk_source_config.ClockFilter = 0;   
  HAL_TIM_ConfigClockSource(&haudio_tim, &s_clk_source_config);
  
  /* Select Input Channel as input trigger */
  s_slave_config.InputTrigger = TIM_TS_TI1FP1;
  s_slave_config.SlaveMode = TIM_SLAVEMODE_EXTERNAL1;
  s_slave_config.TriggerPolarity = TIM_TRIGGERPOLARITY_NONINVERTED;
  s_slave_config.TriggerPrescaler = TIM_CLOCKPRESCALER_DIV1;
  s_slave_config.TriggerFilter = 0;
  HAL_TIM_SlaveConfigSynchronization(&haudio_tim, &s_slave_config);
  
  /* Output Compare PWM Mode configuration: Channel2 */
  s_oc_config.OCMode = TIM_OCMODE_PWM1;
  s_oc_config.OCIdleState = TIM_OCIDLESTATE_SET;
  s_oc_config.Pulse = 1;
  s_oc_config.OCPolarity = TIM_OCPOLARITY_HIGH;
  s_oc_config.OCNPolarity = TIM_OCNPOLARITY_HIGH;
  s_oc_config.OCFastMode = TIM_OCFAST_DISABLE;
  s_oc_config.OCNIdleState = TIM_OCNIDLESTATE_SET;
  
  /* Initialize the TIM4 Channel2 with the structure above */
  HAL_TIM_PWM_ConfigChannel(&haudio_tim, &s_oc_config, AUDIO_TIM_VolumeChangeOUT_CHANNEL);
  
  /* Start the TIM4 Channel2 */
  HAL_TIM_PWM_Start(&haudio_tim, AUDIO_TIM_VolumeChangeOUT_CHANNEL);

  /* Start the TIM4 Channel1 */
  HAL_TIM_IC_Start(&haudio_tim, AUDIO_TIM_VolumeChangeIN_CHANNEL);
}

/**
  * @brief  Configure TIM as a clock divider by 2.
  *         I2S_SCK is externally connected to TIM_VolumeChange input channel
  */
static void TIM_VolumeChangeDeInit(void)
{
  haudio_tim.Instance = AUDIO_TIM_VolumeChange;
  
  /* Stop the TIM4 Channel2 */
  HAL_TIM_PWM_Stop(&haudio_tim, AUDIO_TIM_VolumeChangeOUT_CHANNEL);
  /* Stop the TIM4 Channel1 */
  HAL_TIM_IC_Stop(&haudio_tim, AUDIO_TIM_VolumeChangeIN_CHANNEL);

  HAL_TIM_IC_DeInit(&haudio_tim);
  
  /* Initialize the TIM_VolumeChange peripheral with the structure above */
  TIM_VolumeChangeIC_MspDeInit(&haudio_tim);
}

/**
  * @}
  */ 
  
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
